import 'package:flutter/material.dart';
import 'package:gap/gap.dart';

class ContentOfTakbeer extends StatelessWidget {
  const ContentOfTakbeer({super.key, required this.isDark});

  final bool isDark;

  @override
  Widget build(BuildContext context) {
    return Column(
      children: [
        Gap(30),
        Card(
          color: isDark ? Colors.grey[850] : Colors.white,
          margin: const EdgeInsets.all(12),
          elevation: 3,
          shape: RoundedRectangleBorder(
            borderRadius: BorderRadius.circular(12),
          ),
          child: Padding(
            padding: const EdgeInsets.all(16.0),
            child: Text(
              "التَّكْبِيرَ لهُ شَأْنٌ عَظِيمٌ، وَثَوَابُهُ عِنْدَ اللهِ جَزِيلٌ، "
              "وَقَدْ تَكَاثَرَتِ النُّصُوصُ في الحَثِّ عَلَيْهِ، وَالتَّرْغِيبِ فِيهِ، "
              "وَذِكْرِ ثَوَابِهِ.\n\n"
              "قَالَ تعالى: ﴿وَقُلِ الْحَمْدُ للهِ الَّذِي لَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ "
              "فِي الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيرًا﴾.\n\n"
              "وَقَالَ تعالى: ﴿وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ "
              "وَلَعَلَّكُمْ تَشْكُرُونَ﴾.\n\n"
              "وَقَالَ تعالى: ﴿لَنْ يَنَالَ اللهَ لُحُومَهَا وَلَا دِمَاؤُهَا وَلَكِنْ يَنَالُهُ التَّقْوَى مِنْكُمْ "
              "كَذَلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ وَبَشِّرِ الْمُحْسِنِينَ﴾.\n\n"
              "وَقَالَ تعالى: ﴿يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ﴾.\n\n"
              "فَتَكْبِيرُ اللهِ تعالى شَأْنُهُ عَظِيمٌ، وَأَجْرُهُ كَبِيرٌ، "
              "وَلِهَذَا كَانَ مِنْ شَعَائِرِ الصَّلَاةِ وَالأَذَانِ وَالأَعْيَادِ وَالأَمَاكِنِ العَالِيَةِ، "
              "وَهُوَ أَحَدُ الكَلِمَاتِ التي هِيَ أَفْضَلُ الكَلَامِ بَعْدَ القُرْآنِ العَظِيمِ.\n\n"
              "رَوَى الإِمَامُ مُسْلِمٌ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ رضي الله عنه قَالَ: "
              "قَالَ رَسُولُ اللهِ ﷺ: «أَحَبُّ الْكَلَامِ إِلَى اللهِ أَرْبَعٌ: سُبْحَانَ اللهِ، وَالْحَمْدُ للهِ، "
              "وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ؛ لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ».\n\n"
              "وَفي رِوَايَةٍ لَهُ عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: "
              "قَالَ رَسُولُ اللهِ ﷺ: «لَأَنْ أَقُولَ سُبْحَانَ اللهِ، وَالحَمْدُ للهِ، "
              "وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ، أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ».",
              style: TextStyle(
                fontSize: 18,
                height: 1.8,
                fontFamily: "Amiri Quran",
              ),
            ),
          ),
        ),
        Gap(30),
      ],
    );
  }
}
