//// Azkar Alazan
Map<String, dynamic> azkarAlazan = {
  "title": "أَذكَارُ الأَذَانِ",
  "count": "5",
  "bookmark": "0",
  "content": [
    {
      "text":
          " يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إِلاَّ فِي \n حَيَّ عَلَى الصَّلَاةِ وَحَيَّ عَلَى الْفَلَاحِ \n فَيقُولُ: لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
      "count": "1",
      "fadl": "",
      "source":
          "انظر تخريج روايات الحديث السابق في دعاء دخول المسجد، رقم (20) وزيادة: ((اللهم اعصمني من الشيطان الرجيم)) لابن ماجه. انظر: صحيح ابن ماجه، 1/129 ",
    },
    {
      "text":
          " يَقُولُ: وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبَّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالْإِسْلاَمِ دِينَاً \n يَقُولُ ذَلِكَ عَقِبَ تَشَهُّدِ الْمُؤَذِّنِ ",
      "count": "1",
      "fadl": "",
      "source": "مسلم، 1/ 290، برقم 386 \n ابن خزيمة، 1/220 ",
    },
    {
      "text":
          "يُصَلِّي عَلَى النَّبِيِّ - صلى الله عليه وسلم - بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ الْمُؤَذِّنِ",
      "count": "1",
      "fadl": "",
      "source": "مسلم، 1/ 288، برقم 384",
    },
    {
      "text":
          "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامَاً مَحمُوداً الَّذِي وَعَدْتَهُ، \n [إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ]",
      "count": "1",
      "fadl": "",
      "source":
          "البخاري، 1/ 152،  برقم 614، وما بين المعقوفين للبيهقي، 1/410، وحسَّن إسناده العلامة عبد العزيز بن باز ‘ في تحفة الأخيار، ص38",
    },
    {
      "text":
          "يَدْعُو لِنَفسِهِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَإِنَّ الدُّعَاءَ حِينَئِذٍ لاَ يُرَدُّ",
      "count": "1",
      "fadl": "",
      "source":
          "الترمذي، برقم 3594، ورقم 3595، وأبو داود، برقم 525، وأحمد، برقم 12200، وانظر: إرواء الغليل، 1/262",
    },
  ],
};
