import 'package:flutter/material.dart';

class ContentOfPrayer extends StatelessWidget {
  const ContentOfPrayer({super.key, required this.isDark});
  final bool isDark;
  @override
  Widget build(BuildContext context) {
    return Card(
      color: isDark ? Colors.grey[850] : Colors.white,
      margin: const EdgeInsets.all(12),
      elevation: 3,
      shape: RoundedRectangleBorder(borderRadius: BorderRadius.circular(12)),
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Text(
          "فضل الصلاة على النبي صلى الله عليه وسلم ثابت في أحاديث كثيرة.\n\n"
          "وقد ذكر ابن القيم رحمه الله تسعة وثلاثين فائدة وثمرة للصلاة على النبي صلى الله عليه وسلم، "
          "في كتابه \"جلاء الأفهام في فضل الصلاة والسلام على محمد خير الأنام\" ص 445-455.\n\n"
          "وقال السخاوي رحمه الله: \"وهي – أي الصلاة والسلام على النبي صلى الله عليه وسلم – من أبرك الأعمال وأفضلها، "
          "وأكثرها نفعا في الدين والدنيا، وغير ذلك من الثواب المرغِّبِ للفَطِن الحريص على اقتناء ذخائر الأعمال، "
          "واجتناء الثمرة من نضائر الآمال، في العمل المشتمل على هذه الفضائل العظيمة، والمناقب الكريمة، والفوائد الجمة العميمة، "
          "التي لا توجد في غيره من الأعمال، ولا تعرف في سواه من الأفعال والأقوال، صلى الله عليه وسلم تسليما كثيرا\" "
          "انتهى من \"القول البديع في الصلاة على الحبيب الشفيع\" ص/109.\n\n"
          "ومن ثمرات الصلاة على النبي صلى الله عليه وسلم: تفريج الكرب وذهاب الهم وقضاء الجوائج، "
          "كما روى أحمد (21242) والترمذي (2457) واللفظ له عن أُبَيِّ بْنِ كَعْبٍ، قَالَ:\n\n"
          "كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَهَبَ ثُلُثَا اللَّيْلِ قَامَ فَقَالَ: "
          "يَا أَيُّهَا النَّاسُ اذْكُرُوا اللَّهَ اذْكُرُوا اللَّهَ جَاءَتِ الرَّاجِفَةُ تَتْبَعُهَا الرَّادِفَةُ جَاءَ المَوْتُ بِمَا فِيهِ جَاءَ المَوْتُ بِمَا فِيهِ.",
          style: TextStyle(
            fontSize: 18,
            height: 1.8,
            fontFamily: "Amiri Quran",
          ),
        ),
      ),
    );
  }
}
