import 'package:flutter/material.dart';

class ContentOfEsteghfar extends StatelessWidget {
  const ContentOfEsteghfar({super.key, required this.isDark});
  final bool isDark;
  @override
  Widget build(BuildContext context) {
    return Card(
      color: isDark ? Colors.grey[850] : Colors.white,
      margin: const EdgeInsets.all(12),
      elevation: 3,
      shape: RoundedRectangleBorder(borderRadius: BorderRadius.circular(12)),
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Text(
          "تعود توبة العبد واستغفاره عمّا ارتكب من أخطاءٍ في حياته بفوائد جليلة وآثارٍ عظيمةٍ تنفعه وتقوّيه في نفسه وحياته، "
          "ويُذكر من فوائد وآثار الاستغفار ما يأتي:[١] نيل القرب من الله -تعالى- وكثرة التّعلق به، فكلّما انشغل المسلم بذكر الله زاد قُربه منه. "
          "تفريج الكرب وانشراح الصدور، وذهاب الهموم والغموم. سببٌ في دخول جنّات النعيم والتمتع بما أعدّ الله -تعالى- لأهلها. "
          "سببٌ في صفاء القلب ونقائه، والشعور بالراحة والطمأنينة. مكفّرٌ للذنوب؛ فالإكثار من الاستغفار والمداومة عليه من أسباب مغفرة صغائر الذنوب وكبائرها إن تحقّقت شروط التوبة أيضاً، "
          "علماً أنّ آراء العلماء قد اختلفت في هذا الأمر على النّحو الآتي:[٢] القول الأول (الشافعية): ذهبوا إلى القول بأنّ الاستغفار إن كان مقصد العبد فيه الانكسار والافتقار دون التوبة يكفّر صغائر الذنوب لا كبائرها. "
          "القول الثاني (المالكية والحنفية والحنابلة): ذهبوا إلى القول بأنّ الاستغفار دون التوبة يكفّر جميع الذنوب، فتشمل الكبائر والصغائر. "
          "سببٌ في دفع البلاء الّذي قد يصيب العبد، وطريق لحلّ المشكلات التي تواجهه، والتّغلب على الصعوبات التي تعترضه في حياته.[٣] "
          "نوعٌ من أنواع الدعاء، وحكمه في ذلك حكم الدعاء؛ فالمسلم وهو يستغفر يطلب من ربه -عز وجل- مغفرة ذنوبه، "
          "وكلما رافق ذلك الشعورَ بالانكسار والافتقار والتّذلل بين يدي الله تعالى كلّما كان أرجى لإجابة دعائه، "
          "لا سيما إذا تحرّى مواطن الإجابة وأوقاتها.[٣] "
          "الاستغفار سبب في نزول الغيث وبركة المال وإنبات النبات، قال تعالى: (فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا * يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرارًا*وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا)،[٤] "
          "إضافة إلى أنّه سببٌ للإمداد بالقوّة والمنعة، قال تعالى: (وَيا قَومِ استَغفِروا رَبَّكُم ثُمَّ توبوا إِلَيهِ يُرسِلِ السَّماءَ عَلَيكُم مِدرارًا وَيَزِدكُم قُوَّةً إِلى قُوَّتِكُم وَلا تَتَوَلَّوا مُجرِمينَ).[٥][٦] "
          "سببٌ في استحقاق ونيل رحمة الله تعالى، قال تعالى: (قَالَ يَا قَوْمِ لِمَ تَسْتَعْجِلُونَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ لَوْلَا تَسْتَغْفِرُونَ اللَّـهَ لَعَلَّكُمْ تُرْحَمُونَ).[٧][٨] "
          "سببٌ في تكفير الأخطاء الّتي قد تحصل في المجالس بسبب الحديث الذي يدور فيها، ولزوم الاستغفار بعد كلّ مجلسٍ يُكفر ما بدر منه من سوء.[٨] "
          "سببٌ في النجاة من النار، وفي المقابل نيل الدرجات الرفيعة في الجِنان.\n\n",
          style: TextStyle(
            fontSize: 18,
            height: 1.8,
            fontFamily: "Amiri Quran",
          ),
        ),
      ),
    );
  }
}
